In [1]:
import pandas as pd

In [3]:
apples = pd.Series([9,3,5,1])
oranges = pd.Series([2,6,3,0])

print(apples)
oranges

0    9
1    3
2    5
3    1
dtype: int64

0    2
1    6
2    3
3    0
dtype: int64

# Storing Data in DataFrame

In [4]:
data = {'apples': apples, 'oranges': oranges}
fruits_df = pd.DataFrame(data)

fruits_df

   apples  oranges
0       9        2
1       3        6
2       5        3
3       1        0

In [22]:
states = ['Sindh', 'Sindh', 'Sindh', 'Punjab', 'Punjab', 'Punjab']
years = [2000, 2001, 2002, 2000, 2001, 2002]
population = [1.4, 1.5, 1.8, 1, 1.9, 2]

population_data = {'State': states, 'Year': years, 'Population': population}
population_df = pd.DataFrame(population_data)

population_df

    State  Year  Population
0   Sindh  2000         1.4
1   Sindh  2001         1.5
2   Sindh  2002         1.8
3  Punjab  2000         1.0
4  Punjab  2001         1.9
5  Punjab  2002         2.0

In [17]:
population_df.index = ['1st', '2nd', '3rd', '4th', '5th', '6th']
population_df

      State  Year  Population
1st   Sindh  2000         1.4
2nd   Sindh  2001         1.5
3rd   Sindh  2002         1.8
4th  Punjab  2000         1.0
5th  Punjab  2001         1.9
6th  Punjab  2002         2.0

In [18]:
population_df.head() # This Method returns top 5 rows from DataFrame

      State  Year  Population
1st   Sindh  2000         1.4
2nd   Sindh  2001         1.5
3rd   Sindh  2002         1.8
4th  Punjab  2000         1.0
5th  Punjab  2001         1.9

In [7]:
# Column Arrangment
populationCol_df = pd.DataFrame(population_data, columns = ['Year', 'State', 'Population'])

populationCol_df

   Year   State  Population
0  2000   Sindh         1.4
1  2001   Sindh         1.5
2  2002   Sindh         1.8
3  2000  Punjab         1.0
4  2001  Punjab         1.9
5  2002  Punjab         2.0

In [15]:
PopulationFrame = pd.DataFrame(population_data, columns = ['Year', 'State', 'Population', 'Debt'])

PopulationFrame

   Year   State  Population Debt
0  2000   Sindh         1.4  NaN
1  2001   Sindh         1.5  NaN
2  2002   Sindh         1.8  NaN
3  2000  Punjab         1.0  NaN
4  2001  Punjab         1.9  NaN
5  2002  Punjab         2.0  NaN

In [16]:
PopulationFrame.columns

Index(['Year', 'State', 'Population', 'Debt'], dtype='object')

In [17]:
PopulationFrame.index

RangeIndex(start=0, stop=6, step=1)

In [43]:
# Custom Indexes
PopulationFrame2 = pd.DataFrame(population_data, columns = ['Year', 'State', 'Population', 'Debt'], index = ['one', 'two', 'three', 'four', 'five', 'six'])

PopulationFrame2

       Year   State  Population Debt
one    2000   Sindh         1.4  NaN
two    2001   Sindh         1.5  NaN
three  2002   Sindh         1.8  NaN
four   2000  Punjab         1.0  NaN
five   2001  Punjab         1.9  NaN
six    2002  Punjab         2.0  NaN

In [21]:
PopulationFrame2.index

Index(['one', 'two', 'three', 'four', 'five', 'six'], dtype='object')

# Retrieving Data from DataFrame

A Column in a DataFrame can be Retrieved as a Series either by Dictionary-like Notation or by Attribute

In [27]:
# Dictionary-like Notation
population_data['State']
PopulationFrame2['Year']

one      2000
two      2001
three    2002
four     2000
five     2001
six      2002
Name: Year, dtype: int64

In [28]:
# Attribute-like Notation
# Reference: Attribute same like accessing an attribute(variable) of a Class 
PopulationFrame2.Year

one      2000
two      2001
three    2002
four     2000
five     2001
six      2002
Name: Year, dtype: int64

In [29]:
# Retrieving Data from a specific index of a Specified Column
PopulationFrame2.Year['one']

2000

In [30]:
# Retrieving Data from Index by using loc Method
PopulationFrame2.loc['one']

Year           2000
State         Sindh
Population      1.4
Debt            NaN
Name: one, dtype: object

In [31]:
# Retrieving Data from Nested Index by using loc Method
PopulationFrame2.loc['one']['Year']

2000

In [2]:
import numpy as np

Columns can be modified by assigning values, for example: the empty 'Debt' Column could be assigned a scalar value or an array of values

In [36]:
# Assigning Scalar Value
PopulationFrame2.Debt = 16.2
PopulationFrame2

       Year   State  Population  Debt
one    2000   Sindh         1.4  16.2
two    2001   Sindh         1.5  16.2
three  2002   Sindh         1.8  16.2
four   2000  Punjab         1.0  16.2
five   2001  Punjab         1.9  16.2
six    2002  Punjab         2.0  16.2

In [35]:
# Assigning Array Values
ln = len(PopulationFrame2) # Finding number of rows of a DataFrame
rng = np.arange(ln)
PopulationFrame2['Debt'] = rng
PopulationFrame2

       Year   State  Population  Debt
one    2000   Sindh         1.4     0
two    2001   Sindh         1.5     1
three  2002   Sindh         1.8     2
four   2000  Punjab         1.0     3
five   2001  Punjab         1.9     4
six    2002  Punjab         2.0     5

In [44]:
# Assigning Values with Index Specification
Dept_newData = pd.Series([12, 125, 135, 145, 155, 165], index=['zero', 'two', 'three', 'four', 'five', 'six'])
PopulationFrame2.Debt = Dept_newData
PopulationFrame2

       Year   State  Population   Debt
one    2000   Sindh         1.4    NaN
two    2001   Sindh         1.5  125.0
three  2002   Sindh         1.8  135.0
four   2000  Punjab         1.0  145.0
five   2001  Punjab         1.9  155.0
six    2002  Punjab         2.0  165.0

# Function Application and Mapping

In [5]:
# Creating DataFrame consist of Random Numbers Generated by Numpy, Columns generated by Python List named `bde` & Index by Array:
frame_df = pd.DataFrame(np.random.randn(4, 3), columns = list('bde'), index = ['Utah', 'Ohio', 'Texas', 'Oregon'])
frame_df

               b         d         e
Utah    1.259804 -1.334024 -0.529695
Ohio   -0.839935  1.062360 -1.151432
Texas  -0.131220  0.110397 -2.903297
Oregon -0.040882 -0.998674  0.724086

In [6]:
# Using `abs` means Absolute built-in method of Numpy to convert all negative numbers to positive
np.abs(frame_df)

               b         d         e
Utah    1.259804  1.334024  0.529695
Ohio    0.839935  1.062360  1.151432
Texas   0.131220  0.110397  2.903297
Oregon  0.040882  0.998674  0.724086

In [7]:
# Getting Minimum value of Column `d` from DataFrame using `min` Method of Pandas:
frame_df['d'].min()

-1.3340235711329866

In [8]:
# Getting Maximum value of Column `d` from DataFrame using `max` Method of Pandas:
frame_df['d'].max()

1.062359801308751

In [9]:
# Getting Calulated Result (max - min):
frame_df['d'].max() - frame_df['d'].min()

2.3963833724417376

In [10]:
# This is a way to write anonymous singl-line user defined function's in Python and save result in a variable
# The Keyword `Lambda` is used for anonymous function in Python we can use this Keyword where we don't want to declare anonymous
#         function
# where `x` is used to store every single value iteratedly from the DataFrame/any other Data Source or make Calculation on it, 
#         in-short acts same as `this` keyword in JS or PHP
f = lambda x: x.max() - x.min()

In [12]:
# we are applying that Function on DataFrame
# This will Save Result in Series because it is in 1x1 dimension 1 column and 1 row other wise it will Store in the form of
#         DataFrame
# By Default this user-defined Function make calculation column wise
df_func = frame_df.apply(f)
print(df_func, type(df_func))

b    2.099740
d    2.396383
e    3.627384
dtype: float64 <class 'pandas.core.series.Series'>

In [13]:
# if we want this user-defined function to make calculation row wise, we have to specify axis as specified in below code:
# axis = 0 : column wise (by default)
# axis = 1 : row wise
df_func1 = frame_df.apply(f, axis=1)
print(df_func1, type(df_func1))

Utah      2.593828
Ohio      2.213792
Texas     3.013695
Oregon    1.722761
dtype: float64 <class 'pandas.core.series.Series'>

In [15]:
# Python Normal Named Function:
def min_max(x):
    minimum = x.min()
    maximum = x.max()
    return pd.Series([minimum, maximum], index = ['min', 'max'])

In [16]:
# This user-defined named function will return DataFrame instead of Series beacouse it's dimension is not 1x1
df_func_norm = frame_df.apply(min_max)
print(df_func_norm, type(df_func_norm))

            b         d         e
min -0.839935 -1.334024 -2.903297
max  1.259804  1.062360  0.724086 <class 'pandas.core.frame.DataFrame'>

In [ ]:
# Resume from part#2 @1:45